---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.ForwardIterator
source: html/e603edf6-91d6-2598-307a-2b70e6239de5.htm
---
# Autodesk.Revit.DB.CurveArrArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveArrArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.